// Методи push() - в кінець масиву
// Метод pop() - видаляє з кінця масиву елемент
// Методи split() - перетворює рядок в масив
// Метод join() - об'єднує елементи масиву у рядок
// Метод indexOf()
// Метод includes()
// Метод slice() -повертає новий масив
// Метод splice() - заміна елементу
// Метод concat() - Об'єднує два або більше масивів в один

// 1) базові методи з масивом
// - Створити масив styles з елементами «Джаз» і «Блюз».

// - Добавте «Рок-н-ролл» в кінець.

// - Замініть значення елемента в середині на «Класика».

// - Видаліть перший елемент і виведіть його в консоль.

// - Вставте «Реп» и «Реггі» на початок масива.

// Вигляд масиву по ходу використання методів:
// Джаз, Блюз
// Джаз, Блюз, Рок-н-ролл
// Джаз, Класика, Рок-н-ролл
// Класика, Рок-н-ролл
// Реп, Регги, Класика, Рок-н-ролл

// const style = ["«Джаз»", "«Блюз»"];
// styles.push("«Рок-н-ролл»");
// styles.splice(1,1 "Класика", "Сальсо");
// styles[1] = "Класика";
// styles[2] = "Сальсо";
// styles[3] = "Рок-н-ролл";
// console.log(styles);
// const deliteStyles = styles.shift();
// console.log("Видалений елемент", deliteStyles);
// style.push(deliteStyles);
// styles.shift();
// console.log(styles);
// .....................

// Задача
// Перевірити чи наша строка являється – паліндромом.
// const str = "радар";
